## Classification Algorithm
## Navie Bayes - Grid
### 3. Multinomial Naive Bayes Algorithm

In [1]:
import pandas as pd

### Data collection

In [2]:
dataset = pd.read_csv("Social_Network_Ads.csv")

In [3]:
dataset

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

### Data preprocessing

In [4]:
dataset=pd.get_dummies(dataset,dtype=int,drop_first=True)

In [5]:
dataset

      User ID  Age  EstimatedSalary  Purchased  Gender_Male
0    15624510   19            19000          0            1
1    15810944   35            20000          0            1
2    15668575   26            43000          0            0
3    15603246   27            57000          0            0
4    15804002   19            76000          0            1
..        ...  ...              ...        ...          ...
395  15691863   46            41000          1            0
396  15706071   51            23000          1            1
397  15654296   50            20000          1            0
398  15755018   36            33000          0            1
399  15594041   49            36000          1            0

[400 rows x 5 columns]

In [6]:
dataset= dataset.drop('User ID',axis=1)

In [7]:
dataset

     Age  EstimatedSalary  Purchased  Gender_Male
0     19            19000          0            1
1     35            20000          0            1
2     26            43000          0            0
3     27            57000          0            0
4     19            76000          0            1
..   ...              ...        ...          ...
395   46            41000          1            0
396   51            23000          1            1
397   50            20000          1            0
398   36            33000          0            1
399   49            36000          1            0

[400 rows x 4 columns]

### Check the No of Unique classes and its count

In [8]:
dataset['Purchased'].value_counts()

Purchased
0    257
1    143
Name: count, dtype: int64

### Input Output Split

In [9]:
indep = dataset[['Age','EstimatedSalary','Gender_Male']]
dep = dataset[['Purchased']]

### Train Test Split

In [10]:
from sklearn.model_selection import train_test_split
X_train,X_test,Y_train,Y_test = train_test_split(indep,dep,test_size=0.20,random_state=0)

### Standardization

##### Standardization step is not valid for Multinomial Naive Bayes, It shows
##### ValueError: Negative values in data passed to MultinomialNB (input X)

from sklearn.preprocessing import StandardScaler
SC = StandardScaler()
X_train = SC.fit_transform(X_train)
X_test = SC.transform(X_test)

### Train Set

### Model Creation

In [11]:
# Parameters - MultinomialNB(alpha=0.5, fit_prior=True)  # Default values
# So GridSerchCV is not done here

from sklearn.naive_bayes import MultinomialNB
Classifier = MultinomialNB()
Classifier.fit(X_train,Y_train)

# Test Set
Y_pred = Classifier.predict(X_test)

### Evaluation Metrics 

### Confusion Matix
from sklearn.metrics import confusion_matrix
CM = confusion_matrix(Y_test,Y_pred)

### Classification Report
from sklearn.metrics import classification_report
Clf_report = classification_report(Y_test,Y_pred)
print(Clf_report)
print(CM)

              precision    recall  f1-score   support

           0       0.74      0.64      0.69        58
           1       0.30      0.41      0.35        22

    accuracy                           0.57        80
   macro avg       0.52      0.52      0.52        80
weighted avg       0.62      0.57      0.59        80

[[37 21]
 [13  9]]

C:\Anaconda3\Lib\site-packages\sklearn\utils\validation.py:1300: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [12]:
### ADDITIONAL : Check for the best params & f1_score 
from sklearn.metrics import f1_score
f1_macro = f1_score(Y_test,Y_pred,average='weighted')
f1_macro

0.5919515669515669

In [13]:
# ADDITIONAL : Check roc_auc_score -Receiver Operating Characteristic (Area Under Curve)
# ROC_AUC : Is a performance metric used primarily for binary classification problems to evaluate the quality of a classification model.
from sklearn.metrics import roc_auc_score
ROC_score = roc_auc_score(Y_test,Classifier.predict_proba(X_test)[:,1])
ROC_score

0.48824451410658304

### Check the Model by getting User Input

In [17]:
Age_input = int(input("AGE: "))
Salary_input = int(input("Salary: "))
Gender_input = int(input("Gender Male 0 or 1: "))

AGE:  39
Salary:  30000
Gender Male 0 or 1:  1

### Prediction

In [18]:
Prediction=Classifier.predict([[Age_input,Salary_input,Gender_input]]) 
Prediction

C:\Anaconda3\Lib\site-packages\sklearn\base.py:493: UserWarning: X does not have valid feature names, but MultinomialNB was fitted with feature names
  warnings.warn(

array([0], dtype=int64)